---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.GetAllRuleIds
source: html/ecad22df-ac2e-8aa6-6d6e-03736f72283a.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.GetAllRuleIds Method

Retrieves an enumeration of rule Ids.

## Syntax (C#)
```csharp
public IList<PerformanceAdviserRuleId> GetAllRuleIds()
```

## Returns
A collection of rule Ids